---
kind: property
id: P:Autodesk.Revit.DB.WorksharingTooltipInfo.Creator
source: html/c6d2a047-8f18-103a-804d-cd2a0ff43c40.htm
---
# Autodesk.Revit.DB.WorksharingTooltipInfo.Creator Property

The user name of the user who created the element.

## Syntax (C#)
```csharp
public string Creator { get; }
```